
.data

array: .word 1, 0, 1, 12, 0, 1, 4  

.text

    la a0, array      # Φόρτωση της διεύθυνσης του πίνακα στον a0
    li a1, 7          # Πλήθος στοιχείων (7) στον a1
    li a2, 1          # Αριθμός προς αναζήτηση (1) στον a2

prog:
    li s0, 0          # Αρχικοποίηση του s0 σε 0 (δεν έχουμε βρει ταιριαστό στοιχείο)
    li t0, 0          # Δείκτης για τα στοιχεία του πίνακα (index)

search:
    beq t0, a1, done  # Αν έχουμε ελέγξει όλα τα στοιχεία, πάμε στο done
    lw t1, 0(a0)      # Φόρτωση του τρέχοντος στοιχείου του πίνακα
    beq t1, a2, found # Αν το τρέχον στοιχείο ταιριάζει, πηγαίνουμε στο found

    addi a0, a0, 4    # Μετάβαση στο επόμενο στοιχείο (4 bytes)
    addi t0, t0, 1    # Αυξάνοντας τον δείκτη
    j search           # Επαναλαμβάνουμε την αναζήτηση

found:
    mv s0, a0         # Αποθήκευση της διεύθυνσης του ταιριαστού στοιχείου στο s0
    addi a0, a0, 4    # Μετάβαση στο επόμενο στοιχείο
    j search           # Επαναλαμβάνουμε την αναζήτηση

done:
    # Αν δεν έχει βρεθεί κανένα ταιριαστό στοιχείο, s0 παραμένει 0
    addi a7, zero, 10  # Κωδικός για έξοδο
    ecall              # Κλήση συστήματος
